podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/GENFSK_MKW41Z4.svd.xml
            <register>
               <name>T2_CMP</name>
               <description>T2 COMPARE</description>
               <addressOffset>0xC</addressOffset>
               <resetValue>0xFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>T2_CMP</name>
                     <description>Timer2 (T2) Compare Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>T2_CMP_EN</name>
                     <description>Timer2 (T2) Compare Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMESTAMP</name>
               <description>TIMESTAMP</description>
               <addressOffset>0x10</addressOffset>
               <access>read-only</access>
               <resetMask>0xFF000000</resetMask>
               <fields>
                  <field>
                     <name>TIMESTAMP</name>
                     <description>Received Packet Timestamp</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XCVR_CTRL</name>
               <description>TRANSCEIVER CONTROL</description>
               <addressOffset>0x14</addressOffset>
               <resetMask>0x78FFFFFF</resetMask>
               <fields>
                  <field>
                     <name>SEQCMD</name>
                     <description>Sequence Commands</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0x0</name>
                           <description>No Action</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0x1</name>
                           <description>TX Start Now</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0x2</name>
                           <description>TX Start @ T1 Timer Compare Match (EVENT_TMR = T1_CMP)</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0x3</name>
                           <description>TX Start @ T2 Timer Compare Match (EVENT_TMR = T2_CMP)</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0x4</name>
                           <description>TX Cancel -- Cancels pending TX events but do not abort a TX-in-progress</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0x5</name>
                           <description>RX Start Now</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0x6</name>
                           <description>RX Start @ T1 Timer Compare Match (EVENT_TMR = T1_CMP)</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0x7</name>
                           <description>RX Start @ T2 Timer Compare Match (EVENT_TMR = T2_CMP)</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0x8</name>
                           <description>RX Stop @ T1 Timer Compare Match (EVENT_TMR = T1_CMP)</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0x9</name>
                           <description>RX Stop @ T2 Timer Compare Match (EVENT_TMR = T2_CMP)</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0xA</name>
                           <description>RX Cancel -- Cancels pending RX events but do not abort a RX-in-progress</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0xB</name>
                           <description>Abort All - Cancels all pending events and abort any sequence-in-progress</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDDEC_CS</name>
                     <description>Command Decode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>XCVR_BUSY</name>
                     <description>Transceiver Busy</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>IDLE</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>BUSY</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>XCVR_STS</name>
               <description>TRANSCEIVER STATUS</description>
               <addressOffset>0x18</addressOffset>
               <access>read-only</access>
               <resetMask>0x2000</resetMask>
               <fields>
                  <field>
                     <name>TX_START_T1_PEND</name>
                     <description>TX T1 Start Pending Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_START_T2_PEND</name>
                     <description>TX T2 Start Pending Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_IN_WARMUP</name>
                     <description>TX Warmup Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_IN_PROGRESS</name>
                     <description>TX in Progress Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_IN_WARMDN</name>
                     <description>TX Warmdown Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_START_T1_PEND</name>
                     <description>RX T1 Start Pending Status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_START_T2_PEND</name>
                     <description>RX T2 Start Pending Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_STOP_T1_PEND</name>
                     <description>RX T1 Stop Pending Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_STOP_T2_PEND</name>
                     <description>RX T2 Start Pending Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_IN_WARMUP</name>
                     <description>RX Warmup Status</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_IN_SEARCH</name>
                     <description>RX Search Status</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_IN_PROGRESS</name>
                     <description>RX in Progress Status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_IN_WARMDN</name>
                     <description>RX Warmdown Status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LQI_VALID</name>
                     <description>LQI Valid Indicator</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>LQI is not yet valid for RX packet</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>LQI is valid for RX packet</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRC_VALID</name>
                     <description>CRC Valid Indicator</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>CRC is not valid for RX packet</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CRC is valid for RX packet</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSSI</name>
                     <description>Received Signal Stength Indicator, in dBm</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LQI</name>
                     <description>Link Quality Indicator</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XCVR_CFG</name>
               <description>TRANSCEIVER CONFIGURATION</description>
               <addressOffset>0x1C</addressOffset>
               <resetMask>0xFF0000FF</resetMask>
               <fields>
                  <field>
                     <name>TX_WHITEN_DIS</name>
                     <description>TX Whitening Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_DEWHITEN_DIS</name>
                     <description>RX De-Whitening Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SW_CRC_EN</name>
                     <description>Software CRC Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PREAMBLE_SZ</name>
                     <description>Preamble Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TX_WARMUP</name>
                     <description>Transmit Warmup Time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RX_WARMUP</name>
                     <description>Receive Warmup Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHANNEL_NUM</name>
               <description>CHANNEL NUMBER</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>CHANNEL_NUM</name>
                     <description>Channel Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TX_POWER</name>
               <description>TRANSMIT POWER</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>TX_POWER</name>
                     <description>Transmit Power</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
