podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/GENFSK_MKW41Z4.svd.xml
            <register>
               <name>NTW_ADR_CTRL</name>
               <description>NETWORK ADDRESS CONTROL</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0x5500</resetValue>
               <resetMask>0xFFFFFF0F</resetMask>
               <fields>
                  <field>
                     <name>NTW_ADR_EN</name>
                     <description>Network Address Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>Enable Network Address 0 for correlation</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>Enable Network Address 1 for correlation</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>Enable Network Address 2 for correlation</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>Enable Network Address 3 for correlation</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NTW_ADR_MCH</name>
                     <description>Network Address Match</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>Network Address 0 has matched</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>Network Address 1 has matched</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>Network Address 2 has matched</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>Network Address 3 has matched</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NTW_ADR0_SZ</name>
                     <description>Network Address 0 Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Network Address 0 requires a 8-bit correlation</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Network Address 0 requires a 16-bit correlation</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Network Address 0 requires a 24-bit correlation</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Network Address 0 requires a 32-bit correlation</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NTW_ADR1_SZ</name>
                     <description>Network Address 1 Size</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Network Address 1 requires a 8-bit correlation</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Network Address 1 requires a 16-bit correlation</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Network Address 1 requires a 24-bit correlation</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Network Address 1 requires a 32-bit correlation</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NTW_ADR2_SZ</name>
                     <description>Network Address 2 Size</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Network Address 2 requires a 8-bit correlation</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Network Address 2 requires a 16-bit correlation</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Network Address 2 requires a 24-bit correlation</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Network Address 2 requires a 32-bit correlation</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NTW_ADR3_SZ</name>
                     <description>Network Address 3 Size</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Network Address 3 requires a 8-bit correlation</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Network Address 3 requires a 16-bit correlation</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Network Address 3 requires a 24-bit correlation</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Network Address 3 requires a 32-bit correlation</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NTW_ADR_THR0</name>
                     <description>Network Address 0 Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>NTW_ADR_THR1</name>
                     <description>Network Address 1 Threshold</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>NTW_ADR_THR2</name>
                     <description>Network Address 2 Threshold</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>NTW_ADR_THR3</name>
                     <description>Network Address 3 Threshold</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>NTW_ADR_%s</name>
               <description>NETWORK ADDRESS %s</description>
               <addressOffset>0x2C</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>NTW_ADR_0</name>
                     <description>Network Address 0</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_WATERMARK</name>
               <description>RECEIVE WATERMARK</description>
               <addressOffset>0x3C</addressOffset>
               <resetValue>0xFFF</resetValue>
               <resetMask>0xE000FFFF</resetMask>
               <fields>
                  <field>
                     <name>RX_WATERMARK</name>
                     <description>Receive Watermark</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>BYTE_COUNTER</name>
                     <description>Byte Counter</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSM_CTRL</name>
               <description>DSM CONTROL</description>
               <addressOffset>0x40</addressOffset>
               <access>write-only</access>
               <resetMask>0xFFFFFFFE</resetMask>
               <fields>
                  <field>
                     <name>GENERIC_FSK_SLEEP_EN</name>
                     <description>GENERIC_FSK DSM Sleep Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PART_ID</name>
               <description>PART ID</description>
               <addressOffset>0x44</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PART_ID</name>
                     <description>Part ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PACKET_CFG</name>
               <description>PACKET CONFIGURATION</description>
               <addressOffset>0x60</addressOffset>
               <resetValue>0x40</resetValue>
               <resetMask>0x7F7F7FFF</resetMask>
               <fields>
                  <field>
                     <name>LENGTH_SZ</name>
                     <description>LENGTH Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>LENGTH_BIT_ORD</name>
                     <description>LENGTH Bit Order</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>LS Bit First</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>MS Bit First</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYNC_ADDR_SZ</name>
                     <description>Sync Address Size</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LENGTH_ADJ</name>
                     <description>Length Adjustment</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>LENGTH_FAIL</name>
                     <description>Maximum Length Violated Status Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>H0_SZ</name>
                     <description>H0 Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>H0_FAIL</name>
                     <description>H0 Violated Status Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>H1_SZ</name>
                     <description>H1 Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>H1_FAIL</name>
                     <description>H1 Violated Status Bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>H0_CFG</name>
               <description>H0 CONFIGURATION</description>
               <addressOffset>0x64</addressOffset>
               <fields>
                  <field>
                     <name>H0_MATCH</name>
                     <description>H0 Match Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>H0_MASK</name>
                     <description>H0 Mask Register</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>H1_CFG</name>
               <description>H1 CONFIGURATION</description>
               <addressOffset>0x68</addressOffset>
               <fields>
                  <field>
                     <name>H1_MATCH</name>
                     <description>H1 Match Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>H1_MASK</name>
                     <description>H1 Mask Register</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRC_CFG</name>
               <description>CRC CONFIGURATION</description>
               <addressOffset>0x6C</addressOffset>
               <resetValue>0x2</resetValue>
               <fields>
                  <field>
                     <name>CRC_SZ</name>
                     <description>CRC Size (in octets)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>CRC_START_BYTE</name>
                     <description>Configure CRC Start Point</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CRC_REF_IN</name>
                     <description>CRC Reflect In</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>do not manipulate input data stream</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>reflect each byte in the input stream bitwise</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRC_REF_OUT</name>
                     <description>CRC Reflect Out</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>do not manipulate CRC result</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CRC result is to be reflected bitwise (operated on entire word)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRC_BYTE_ORD</name>
                     <description>CRC Byte Order</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>LS Byte First</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>MS Byte First</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRC_INIT</name>
               <description>CRC INITIALIZATION</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>CRC_SEED</name>
                     <description>CRC Seed Value</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRC_POLY</name>
               <description>CRC POLYNOMIAL</description>
               <addressOffset>0x74</addressOffset>
               <resetValue>0x10210000</resetValue>
               <fields>
                  <field>
                     <name>CRC_POLY</name>
                     <description>CRC Polynomial</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRC_XOR_OUT</name>
               <description>CRC XOR OUT</description>
               <addressOffset>0x78</addressOffset>
               <fields>
                  <field>
                     <name>CRC_XOR_OUT</name>
                     <description>CRC XOR OUT Register</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
