podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/GENFSK_MKW41Z4.svd.xml
            <register>
               <name>WHITEN_CFG</name>
               <description>WHITENER CONFIGURATION</description>
               <addressOffset>0x7C</addressOffset>
               <resetValue>0x1FF0918</resetValue>
               <fields>
                  <field>
                     <name>WHITEN_START</name>
                     <description>Configure Whitener Start Point</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>no whitening</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>start whitening at start-of-H0</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>start whitening at start-of-H1 but only if LENGTH &gt; WHITEN_SZ_THR</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>start whitening at start-of-payload but only if LENGTH &gt; WHITEN_SZ_THR</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WHITEN_END</name>
                     <description>Configure end-of-whitening</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>end whiten at end-of-payload</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>end whiten at end-of-crc</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WHITEN_B4_CRC</name>
                     <description>Congifure for Whitening-before-CRC</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>CRC before whiten/de-whiten</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Whiten/de-whiten before CRC</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WHITEN_POLY_TYPE</name>
                     <description>Whiten Polynomial Type</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WHITEN_REF_IN</name>
                     <description>Whiten Reflect Input</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WHITEN_PAYLOAD_REINIT</name>
                     <description>Configure for Whitener re-initialization</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t re-initialize Whitener LFSR at start-of-payload</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Re-initialize Whitener LFSR at start-of-payload</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WHITEN_SIZE</name>
                     <description>Length of Whitener LFSR</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MANCHESTER_EN</name>
                     <description>Configure for Manchester Encoding/Decoding</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disable Manchester encoding (TX) and decoding (RX)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enable Manchester encoding (TX) and decoding (RX)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MANCHESTER_INV</name>
                     <description>Configure for Inverted Manchester Encoding</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Manchester coding as per 802.3</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Manchester coding as per 802.3 but with the encoding signal inverted</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MANCHESTER_START</name>
                     <description>Configure Manchester Encoding Start Point</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Start Manchester coding at start-of-payload</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Start Manchester coding at start-of-header</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WHITEN_INIT</name>
                     <description>Initialization Value for Whitening/De-whitening</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WHITEN_POLY</name>
               <description>WHITENER POLYNOMIAL</description>
               <addressOffset>0x80</addressOffset>
               <resetValue>0x21</resetValue>
               <fields>
                  <field>
                     <name>WHITEN_POLY</name>
                     <description>Whitener Polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WHITEN_SZ_THR</name>
               <description>WHITENER SIZE THRESHOLD</description>
               <addressOffset>0x84</addressOffset>
               <resetValue>0x800</resetValue>
               <fields>
                  <field>
                     <name>WHITEN_SZ_THR</name>
                     <description>Whitener Size Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>LENGTH_MAX</name>
                     <description>Maximum Length for Received Packets</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>REC_BAD_PKT</name>
                     <description>Receive Bad Packets</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>packets which fail H0, H1, or LENGTH_MAX result in an automatic recycle after the header is received and parsed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>packets which fail H0, H1, or LENGTH_MAX are received in their entirety</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>BITRATE</name>
               <description>BIT RATE</description>
               <addressOffset>0x88</addressOffset>
               <fields>
                  <field>
                     <name>BITRATE</name>
                     <description>Bit Rate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>1Mbit/sec</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>500Kbit/sec</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>250Kbit/sec (not supported if WHITEN_CFG[MANCHESTER_EN]=1</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PB_PARTITION</name>
               <description>PACKET BUFFER PARTITION POINT</description>
               <addressOffset>0x8C</addressOffset>
               <resetValue>0x220</resetValue>
               <fields>
                  <field>
                     <name>PB_PARTITION</name>
                     <description>Packet Buffer Partition Point</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
